Repository: mkappus1/DatenmanagementMTHS24
Catalog: Woche 2/Skripte/TMX-EN-DE/tmx_teil_4.tmx
Source language: de
Languages: en

source: Bierdeckel, nicht aus Papier oder Stoff
en: Beer mats not of paper or textile

source: Serviertabletts, nicht aus Edelmetall
en: Serving trays, not of precious metal

source: Packsäcke aus Kunststoff für den Transport von Massengütern
en: Packaging bags [sacks] of plastic for bulk transportation

source: Packsäcke aus Textil für die Lagerung von Massengütern
en: Packaging bags [sacks] of textile for bulk storage

source: Säcke aus sythetischen Materialien für die Lagerung von Schüttgut
en: Bags [sacks] made of synthetic plastics material for bulk storage

source: Bindfäden aus Kunststofffasern
en: Binding twine made of plastic fibres

source: Flaschenverpackungen aus Stroh
en: Straw wrappers for bottles

source: Rohbaumwolle für Futons
en: Cotton batting for futon

source: Jutefasern [roh]
en: Jute fiber [raw]

source: Kabel, nicht aus Metall
en: Cables, not of metal

source: Holzwolle
en: Wood wool

source: Webgurte, nicht aus Metall, für den Lastentransport
en: Webbed belts (Non-metallic -) for handling loads

source: Planen für Zelte
en: Awnings for tents

source: Gräser für Polsterzwecke
en: Grasses for upholstering

source: Polstermaterial [Verpackung], ausgenommen aus Gummi, Kunststoff, Papier oder Pappe
en: Packing [cushioning, stuffing] materials, not of rubber, plastics, paper or cardboard

source: Polstermaterial [ausgenommen aus Gummi oder Kunststoff] für Kissen
en: Padding materials, other than of rubber or plastic for pillows

source: Zelte zum Bergsteigen oder Camping
en: Tents for mountaineering or camping

source: Keramische Textilfasern
en: Ceramic textile fibres

source: Seile aus Kunststoff
en: Cords made of plastics

source: Schappe [Polsterfüllmaterial]
en: Schappe [raw silk waste]

source: Kunststoffbeutel [Säcke] für den Massengütertransport
en: Plastics bags [sacks] for the transport of materials in bulk

source: Chemiefasern für Textilzwecke
en: Chemical fibers for textile use

source: Behälter [Säcke] aus Geotextilien
en: Geotextile containers [bags] made of textile

source: Säcke aus textilem Material zur Aufbewahrung von Zelten
en: Bags made of textile for the storage of tents

source: Kohlenstofffasern für textile Zwecke
en: Carbon fibers [fibres] for textile use

source: Schafvliese für die Polsterindustrie
en: Fleece for the upholstery industry

source: Hebeschlingen aus textilen Materialien
en: Hoisting slings made of textile materials

source: Seile [nicht aus Metall] zum Bewegen von Gegenständen
en: Ropes (Non-metallic -) for handling articles

source: Säcke zum Aufbewahren von Material
en: Sacks for the storage of materials

source: Bodenplanen aus Vinyl
en: Vinyl ground cloth

source: Zelte [nicht zum Campen]
en: Tents [not for camping]

source: Vordächer [Markisen]
en: Canopies [awnings]

source: Temporäre Bauten aus Leinen
en: Semi-permanent canvas structures

source: Elastische Zwischenbehälter [Säcke] für Schüttgut zum Transport von pulverförmigen Materialien
en: Flexible intermediate bulk containers [sacks] for transporting pulverulent materials

source: Kunststoffauskleidungen für Behälter [Säcke]
en: Plastic liners [sacks] for containers

source: Abdeckplanen aus Kunststoff für den Transport gebündelter Ladungen
en: Plastics fabric covers for bundling loads for transport

source: Postsäcke
en: Mail bags

source: Zelte aus Textilmaterialien
en: Tents made of textile materials

source: Bindfäden aus natürlichen Textilfasern
en: Binding twine made of natural textile fibres

source: Schurwolle
en: Shorn wool

source: Füllungen aus Synthetikschaum
en: Fillings of synthetic foam

source: Textile Schutzbeutel zur Lagerung nicht genutzter Handtaschen
en: Protection pouches made of fabric for storing purses when not in use

source: Polyethylensäcke für den Transport von Schüttgut
en: Polythene sacks for the transport of materials in bulk

source: Packmittel aus Stroh
en: Random packings of straw

source: Seile [nicht aus Metall] zum Sichern von Gegenständen
en: Ropes (Non-metallic -) for securing articles

source: Seile für Zelte
en: Ropes for tents

source: Polstermaterial aus Faserstoffen
en: Padding materials made of fibrous material

source: Halbsynthetische Fasern [für textile Zwecke]
en: Semi-synthetic fibers [for textile use]

source: Abdeckungen für Fahrzeuge in Form von Planen
en: Covers in the nature of tarpaulins for vehicles

source: Schnüre [nicht aus Metall] für die Handhabung von Lasten
en: Strings of non-metallic materials for use in handling loads

source: Temporäre Bauten aus Leinen [Zelte]
en: Temporary structures made of fabrics

source: Elastische Schüttgutcontainer [Säcke] zum Transport von Materialien
en: Flexible intermediate bulk containers [sacks] for transporting materials

source: Polyethylensäcke für die Lagerung von Massengütern
en: Polythene bags [sacks] for the storage of materials in bulk

source: Beschlagleinen [Tauwerk]
en: Fibrous gaskets for ships

source: Säcke zum Verpacken von Schüttgut
en: Bags [sacks] for packaging materials in bulk

source: Polstermaterial, ausgenommen aus Gummi oder Kunststoff, zum Fixieren von Lasten
en: Padding materials, other than of rubber or plastic for use in restraining loads

source: Polyethylensäcke für die Lagerung von Schüttgut
en: Polythene sacks for the storage of materials in bulk

source: Packsäcke aus Textil für den Transport von Massengütern
en: Packaging bags [sacks] of textile for bulk transportation

source: Beutel [Säcke] für Transportzwecke
en: Bags [sacks] for transportation purposes

source: Lose Federn
en: Loose feathers

source: Stoffsäcke zum Heben von Erde
en: Textile bags for lifting earth

source: Federn für Bettzeug
en: Feathers for bedding

source: Ledergurte für den Transport von Lasten
en: Belts made of leather for handling loads

source: Federn als Polsterfüllmaterial
en: Feathers for stuffing upholstery

source: Polypropylentaschen für die Lagerung [nicht als Gepäckbehältnis oder für Reisen]
en: Polypropylene bags used for the storage [not for luggage or travel]

source: Flachsfasern [roh]
en: Flax fiber [raw]

source: Überdachungsplanen zum Angeln
en: Canopies for use in angling

source: Bändchen zum Rebenbinden
en: Strips for tying-up vines

source: Aufhängeschnüre für Bilder
en: Cords for hanging pictures

source: Packsäcke aus Kunststoff für die Lagerung von Massengütern
en: Packaging bags [sacks] of plastic for bulk storage

source: Säcke für den Transport von Material
en: Sacks for the transport of materials

source: Polstermaterial [ausgenommen aus Gummi oder Kunststoff] für Schlafsäcke
en: Padding materials, other than of rubber or plastic for sleeping bags

source: Planen [ausgenommen für Schiffe]
en: Tarpaulins [not for ships]

source: Abdeckungen in Form von Planen
en: Coverings in the nature of tarpaulins

source: Segel für Katamarane
en: Sails for catamarans

source: Elastische Schüttgutcontainer [Säcke] zum Transportieren von Materialien in Partikelform
en: Flexible intermediate bulk containers [sacks] for transporting particulate materials

source: Lastentraggurte, nicht aus Metall
en: Straps, not of metal, for handling loads

source: Festmachtaue, nicht aus Metall
en: Mooring cables, not of metal

source: Natürliche Fasern
en: Natural fibers

source: Stroh als Polsterfüllmaterial
en: Straw for stuffing upholstery

source: Bindegarne [nicht aus Metall] für landwirtschaftliche Zwecke
en: Binding thread, not of metal, for agricultural purposes

source: Zurrleinen, nicht aus Metall, zum Binden
en: Lashings (Non-metallic -) for binding

source: Auslegeplanen für große Container
en: Liners for use in bulk containers

source: Rückhaltegurte für Lasten [nicht aus Metall] zur Verwendung mit transportablen Frachtcontainern
en: Load restraining straps (Non-metallic -) for use with transportable freight containers

source: Kunststofffasern für Textilzwecke
en: Plastic fibers [fibres] for textile use

source: Rohfasern aus Kohlenstoff für textile Zwecke
en: Raw fibres of carbon for textile use

source: Holzspäne als Füllmaterial
en: Wood shavings for stuffing

source: Holzspäne zur Verwendung als Füllmaterial
en: Shavings (Wood -) for use as a stuffing

source: Säcke, nicht aus textilem Material, für den Transport von Futtermitteln als Schüttgut
en: Non-textile bags for the transportation of animal foodstuffs in bulk

source: Polstermaterial aus Vliesstoffen
en: Padding made of non woven fabrics

source: Textile Waschsäcke [nicht als Gepäckstück oder für Reisen]
en: Cloth bags for laundry [not for luggage or travel]

source: Seile und synthetische Seile
en: Ropes and synthetic ropes

source: Seile aus Textilfasern
en: Cords made of textile fibres

source: Stoffriemen zum Tragen von Lasten
en: Fabric belts for handling loads

source: Kamelhaar
en: Camel hair

source: Versiegelbare Kunststoffsäcke für den Transport von Schüttgut
en: Sealable plastic bags for transporting materials in bulk

source: Polstermaterial aus Pferdehaar
en: Stuffing materials of horsehair

source: Kunststoffsäcke für die Lagerung von Massengütern
en: Plastics bags [sacks] for the storage of materials in bulk

source: Versandtaschen aus Stoff
en: Fabric mailing pouches

source: Netze für schwimmende Bauten
en: Nets for use with floating structures

source: Planen aus kunststoffbeschichteten Materialien
en: Tarpaulins made from plastics coated materials

source: Stoffsäcke zum Entladen von Erde
en: Textile bags for discharging earth

source: Bänder [nicht aus Metall] zum Einwickeln
en: Ties (Non-metallic -) for wrapping

source: Säcke für Aufbewahrungszwecke
en: Bags for storage purposes

source: Säcke für den Transport von Getreide
en: Bags for the bulk handling of grains

source: Säcke für die Lagerung von Getreide
en: Bags for the bulk storage of grains

source: Säcke für die Aufbewahrung von Schüttgut
en: Sacks for the storage of materials in bulk

source: Säcke zum Lagern von losem Tee
en: Bags for the storage of tea in bulk

source: Nicht angepasste Planen für Boote und Wasserfahrzeuge
en: Unfitted covers for boats and marine vehicles

source: Pferdehaar [nicht für Textilzwecke]
en: Horsehair [not for textile use]

source: Sägemehl
en: Sawdust

source: Wasserdichte Abdeckungen [Planen]
en: Waterproof covers [tarpaulins]

source: Zelte [Markisen] für Wohnwagen
en: Tents [awnings] for caravans

source: Zelte [Markisen] für Fahrzeuge
en: Tents [awnings] for vehicles

source: Säcke aus Reisstroh [Tawara]
en: Rice straw bags (tawara)

source: Segel für Jachten
en: Sails for yachts

source: Markisen mit speziellen Filtern zum Sonnen ohne Verbrennungsgefahr
en: Awnings having special filters permitting a suntan without burning

source: Waschsäcke für Strumpfwaren
en: Bags for washing hosiery

source: Umreifungen aus Textilfasern mit Vorrichtungen zum Sichern von Gegenständen
en: Strapping of textile fibres with device attached for securing articles

source: Bänder aus Kunststoffmaterialien zum Festzurren
en: Straps made of plastic materials for tying purposes

source: Textilfasern aus Vlies
en: Non-woven textile fibres

source: Packsäcke für den Transport von Schüttgut
en: Packaging sacks for transporting materials in bulk

source: Festzurrgurte für Fahrzeuge
en: Tie-down cords for vehicles

source: Bindfäden für Schnürzwecke
en: Strings for tying purposes

source: Gedrehte Aufhängeschnüre für Bilder
en: Twisted cords for hanging pictures

source: Polsterung als Füllung [nicht aus Gummi oder Kunststoff]
en: Cushioning in the nature of stuffing [not of rubber or plastic]

source: Materialien [Säcke] zum Einpacken von losen Granulaterzeugnissen
en: Materials [sacks] for packaging granulose products in bulk

source: Säcke aus Chemiefasern [für industrielle Zwecke]
en: Chemical fiber bags [for use in industry]

source: Netzbahnen aus Polypropylen [Halbfabrikate]
en: Sheets of polypropylene netting [non-finished goods]

source: Schuhsäcke für Lagerzwecke
en: Shoe bags for storage

source: Papierpacksäcke für den Transport von Schüttgut
en: Paper bags for the transport of materials in bulk

source: Schutznetze für den Gartenbau
en: Nets for protective use in gardening

source: Stoffbeutel zur Aufnahme von Erde
en: Textile bags for containing earth

source: Strickleitern
en: Rope ladders

source: Säcke zum Transport und für die Lagerung von Massengütern
en: Sacks for the transport and storage of materials in bulk

source: Kokons
en: Cocoons

source: Reisstrohsäcke [Kamasu]
en: Rice straw bags (kamasu)

source: Packsäcke aus Papier für die Lagerung von Massengütern
en: Packaging bags [sacks] of paper for bulk storage

source: Abdeckplanen für Fahrzeuge [nicht angepasst]
en: Protective shrouds for vehicles [not shaped]

source: Rohfasern aus Kunststoff für textile Zwecke
en: Raw fibres of plastics for textile use

source: Seile [nicht aus Metall] zum Heben von Gegenständen
en: Ropes (Non-metallic -) for lifting articles

source: Gewebe in Form von Zeltvorbauten
en: Fabric in the form of a canopy cover

source: Polstermaterial für Betten, nicht aus Gummi oder Kunststoff
en: Padding materials, other than of rubber or plastic for beds

source: Hanffasern [roh]
en: True hemp fiber [raw]

source: Hanf
en: Hemp

source: Elastische Netze für Fleischprodukte
en: Elastic netting for meat products

source: Allzweckplanen aus Kunststoff
en: All-purpose tarpaulins of plastic

source: Netze aus Chemiefasern
en: Chemical fiber nettings

source: Gurte zum Verschnüren von Bündeln
en: Straps for securing bundles

source: Polstermaterial, ausgenommen aus Gummi oder Kunststoff, zum Stützen von Lasten
en: Padding materials, other than of rubber or plastic for use in supporting loads

source: Säcke
en: Sacks

source: Zelte zur Verwendung als Anbau an Fahrzeugen
en: Tents for use as an adjunct to vehicles

source: Säcke für den Transport von losem Tee
en: Bags for the transport of tea in bulk

source: Segel
en: Sails

source: Jutesäcke [für industrielle Zwecke]
en: Jute bags [for use in industry]

source: Netze [nicht aus Metall oder Asbest]
en: Netting [not of metal or asbestos]

source: Pferdehaar [nicht für textile Zwecke, nicht für Bürsten]
en: Horsehair [not for textile use, not for brushes]

source: Polster- und Füllmaterialien
en: Padding and stuffing materials

source: Füllmaterial aus künstlichen Fasern
en: Fillings of synthetic fibres

source: Füllmaterial, ausgenommen aus Gummi, Kunststoff, Papier oder Pappe
en: Packaging bags [sacks] of paper for bulk transportation

source: Mit flammenhemmenden Mitteln behandelte rohe Gespinstfasern
en: Padding materials, not of rubber, plastics, paper or cardboard

source: Füllungen für Federbetten, nicht aus Gummi oder Kunststoff
en: Fibres being raw synthetic materials for textile use

source: Säcke für den Transport von Abfall
en: Sacks for transporting waste

source: Füllmaterial aus Stroh
en: Stuffing materials of straw

source: Synthetische Textilfasern
en: Synthetic textile filaments

source: Vorratssäcke aus Nylon und Leinen für Staubsaugerzubehör
en: Storage bags made of nylon and canvas for vacuum cleaner accessories

source: Polstermaterial [ausgenommen aus Gummi oder Kunststoff] zur Verwendung bei der Herstellung von Möbeln
en: Padding materials, other than of rubber or plastic for use in the manufacture of furniture

source: Netzgehege für die Fischzucht
en: Net pens for fish farming

source: Markisen und Planen
en: Awnings and tarpaulins

source: Segel für Boote
en: Sails for boats

source: Planen [für Schiffe]
en: Tarpaulins [for ships]

source: Bindebänder, nicht aus Metall, für landwirtschaftliche Erzeugnisse
en: Tapes, not of metal for binding agricultural products

source: Zugseile, nicht aus Metall
en: Towing cables (Non-metallic -)

source: Gurtbänder für Lasten, nicht aus Metall
en: Webbing straps (Non-metallic -) for handling loads

source: Planen, Markisen, Zelte und nicht angepasste Abdeckungen
en: Tarpaulins, awnings, tents, and unfitted coverings

source: Schlingen und Bänder
en: Slings and bands

source: Beutel und Säcke für Verpackung, Lagerung und Transport
en: Bags and sacks for packaging, storage and transport

source: Seile und Bindfäden
en: Ropes and strings

source: Waren aus Gewebe und Fasern
en: Goods made of textile and fibers

source: Rohe textile Fasern und deren Ersatzstoffe
en: Raw textile fibers and substitutes

source: Bänder, nicht aus Metall
en: Bindings, not of metal

source: Netze zur Tarnung von Radarfallen
en: Camouflage nets for radar use

source: Camouflagenetze zur visuellen Tarnung
en: Camouflage nets for visual use

source: Grobe Tierhaare
en: Coarse animal hairs

source: Elastische Bänder zum Binden
en: Elastic bands for binding

source: Metallische Fasern für textile Zwecke
en: Metallic fibers for textile use

source: Marderhundhaar [nicht für Textilzwecke, nicht für Pinsel]
en: Raccoon dog hair [not for textile use, not for brushes]

source: Verpackungsbeutel, -hüllen, -taschen aus textilem Material
en: Bags [envelopes, pouches] of textile, for packaging

source: Zelte
en: Tents

source: Daunen [Federn]
en: Down [feathers]

source: Daunenfedern als Füllmaterial
en: Down feathers for use as stuffing

source: Seile
en: Ropes

source: Segel für Segelboote
en: Windsurfing sails

source: Segel zum Skisegeln
en: Sails for ski sailing

source: Synthetikfasern für Textilzwecke
en: Synthetic fibers for textile use

source: Markisen aus Kunststoff
en: Awnings of synthetic materials

source: Rohe Gespinstfasern
en: Raw fibrous textile

source: Rohe Textilfasern
en: Raw textile fibers

source: Hebeschlingen, nicht aus Metall, für Lasten
en: Slings, not of metal, for handling loads

source: Künstliche Haare für Polster- und Füllzwecke
en: Artificial hair for stuffing and padding purposes

source: Netze gegen Steinschlag
en: Rockfall prevention nets

source: Leichensäcke zur Aufbewahrung bis zur Feuerbestattung
en: Storage bags for holding a body prior to cremation

source: Stoffschlingen für Lasten
en: Cargo slings of fabric

source: Seilschlingen für Lasten
en: Cargo slings of rope

source: Kunststoffwindschutzplanen für Tennisplätze
en: Plastic windscreens for use on tennis courts

source: Polymerfaservlies für Textilzwecke
en: Non-woven polymeric fibers for textile use

source: Fasern für die Herstellung von Darmsaiten für Schläger
en: Fibers for the manufacture of gut for rackets

source: Stoffbeutel zum Sichern von Wertsachen
en: Cloth bags for securing valuables

source: Synthetische Seile
en: Synthetic ropes

source: Polsterfüllstoffe [ausgenommen aus Papier, Pappe [Karton], Kautschuk oder Kunststoffen
en: Padding and stuffing materials (except of paper, cardboard, rubber or plastics)

source: Netze
en: Nets

source: Synthetische Garne
en: Synthetic threads

source: Gedrehte Fäden
en: Twisted thread

source: Kardierte Garne aus Wolle für textile Zwecke
en: Carded threads in wool for textile use

source: Baumwolle zum Stopfen
en: Cotton for darning

source: Garne für textile Applikationen
en: Yarns for textile applications

source: Papiergarne [für textile Zwecke]
en: Paper yarn [for textile use]

source: Nähfäden für textile Zwecke
en: Sewing thread for textile use

source: Hitzebeständige Garne und Fäden
en: Heat-stable yarns and threads

source: Kardierte Garne aus Naturfasern für textile Zwecke
en: Carded threads in natural fibres for textile use

source: Gemischte, gedrehte Garne und Fäden
en: Twisted mixed thread and yarn

source: Webfäden für die Textilindustrie
en: Weaving fibres for industrial use

source: Kardierte Garne aus Wolle
en: Yarns (Carded -) made of wool

source: Garne aus Angora für textile Zwecke
en: Yarns made of angora for textile use

source: Garne und Fäden
en: Yarns and threads

source: Elastische Fäden
en: Elastic thread

source: Textilgarne aus Naturfasern
en: Textile yarns made of natural fibres

source: Strickgarne aus Nylon
en: Knitting yarns made of nylon

source: Strickgarne aus Wolle
en: Knitting yarns made of wool

source: Nicht metallische Garne für textile Zwecke
en: Non-metallic yarns for textile use

source: Chenille [Garn]
en: Chenille yarn

source: Kardierte Garne aus Hanf für textile Zwecke
en: Carded yarns of hemp for textile use

source: Keramikfasergarne für textile Zwecke
en: Ceramic fibre yarns for textile use

source: Elastische Streifen aus künstlichen Fäden für textile Zwecke
en: Elastic strips of synthetic fibres for textile use

source: Fäden aus gesponnener Baumwolle
en: Threads made of spun cotton

source: Garne aus Kohlenstofffasern für textile Zwecke
en: Yarns made of carbon fibres for textile use

source: Gebrochene Kunstfasergarne für textile Zwecke
en: Chopped plastic fibres for textile use

source: Gedrehte Wollgarne und -fäden
en: Twisted wool thread and yarn

source: Gedrehte Baumwollgarne und -fäden
en: Twisted cotton thread and yarn

source: Versponnene Fäden und Garne
en: Mixed spun threads and yarns

source: Glasfäden [Garne] für Textilzwecke
en: Fibreglass thread for textile use

source: Strickgarne aus Acrylmaterialien
en: Knitting yarns made of acrylic materials

source: Natürliche Garne
en: Natural yarns

source: Kardierte Fäden aus Flachs für textile Zwecke
en: Carded threads in flax for textile use

source: Gedrehte Hanfgarne und -fäden
en: Twisted hemp thread and yarn

source: Garne und Fäden aus Wolle
en: Wool base mixed thread and yarn

source: Garne und Fäden aus Chemiefaser für Textilzwecke
en: Chemical-fiber threads and yarns for textile use

source: Polyesterfäden für textile Zwecke
en: Spun polyester fibre for textile use

source: Garne und Fäden aus Seide
en: Silk base mixed thread and yarn

source: Umhüllte Gummifäden und -garne [für Textilzwecke]
en: Covered rubber thread and yarn [for textile use]

source: Garne und Fäden aus entfetteten Abfällen
en: Degreased waste threads and yarns

source: Kurzwaren [Garne]
en: Haberdashery [thread]

source: Gummifäden für Textilzwecke
en: Rubber thread for textile use

source: Garne aus Polytetrafluorethylen für textile Zwecke
en: Yarns made of polytetrafluoroethylene for textile use

source: Gedrehte Seidengarne und -fäden
en: Twisted silk thread and yarn

source: Gedrehte Garne und Fäden
en: Twisted threads and yarns

source: Webfäden zum Gebrauch in Pumpenpackungen
en: Weaving fibres for use in pump packings

source: Garne für Haushaltszwecke
en: Yarns for domestic use

source: Garne aus bearbeitetem Polyester
en: Polyester pre-oriented yarns

source: Garne und Fäden aus regenerierten Fasern [für textile Zwecke]
en: Regenerated fiber thread and yarn [for textile use]

source: Garne und Fäden aus Hanf
en: Hemp base mixed thread and yarn

source: Elastische Garne und Fäden für Textilzwecke
en: Elastic thread and yarn for textile use

source: Gedrehte Gold- und Silberfäden
en: Thread of metal for embroidery

source: Gekämmte Garne aus Naturfasern
en: Yarns (Combed -) made of natural fibres

source: Strukturierte Polyestergarne
en: Polyester textured yarns

source: Ramiefäden und -garne
en: Ramie thread and yarn

source: Garne aus synthetischen Fasern oder Mischfasern für textile Zwecke
en: Yarn of synthetic or mixed fibres for use in textiles

source: Garne und Fäden für Textilzwecke
en: Yarns and threads for textile use

source: Garne
en: Yarn

source: Garne für Textilzwecke
en: Yarns for textile use

source: Fäden für Textilzwecke
en: Thread for textile use

source: Vergoldete Fäden für Textilzwecke
en: Gilt thread for textile use

source: Metallfaserfäden für Textilzwecke
en: Metal fiber thread for textile use

source: Silberfäden für Textilzwecke
en: Silver thread for textile use

source: Umhüllte Gummigarne für Textilzwecke
en: Covered rubber yarn for textile use

source: Gardinenhalter aus Textilstoffen
en: Curtain holders of textile material

source: Textile Stückwaren aus Kunststoffen
en: Textile piece goods made of plastics materials
